---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsValidObject
source: html/e481a855-789c-1638-a7db-e7dc0d7d0782.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.